---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyReference
source: html/349244aa-7a2c-0a9e-304e-d07c5597c0bd.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyReference

Represents a connected property of material.

## Syntax (C#)
```csharp
public class AssetPropertyReference : AssetProperty
```